-- phpMyAdmin SQL Dump
-- version 4.7.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 03 2019 г., 06:25
-- Версия сервера: 5.6.37
-- Версия PHP: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `MySite`
--
DROP DATABASE IF EXISTS `MySite`;
CREATE DATABASE IF NOT EXISTS `MySite` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `MySite`;

-- --------------------------------------------------------

--
-- Структура таблицы `articles`
--

DROP TABLE IF EXISTS `articles`;
CREATE TABLE `articles` (
  `id` int(10) UNSIGNED NOT NULL,
  `id_user` int(10) UNSIGNED NOT NULL,
  `title` varchar(256) NOT NULL,
  `annotation` varchar(1024) NOT NULL,
  `text` text NOT NULL,
  `teg` varchar(64) NOT NULL,
  `comments` int(10) UNSIGNED NOT NULL,
  `data` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `articles`
--

INSERT INTO `articles` (`id`, `id_user`, `title`, `annotation`, `text`, `teg`, `comments`, `data`) VALUES
(1, 2, 'Первая статья о статье.', 'Здесь будет много много много букв...... а может и нет....', 'Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....Здесь будет много много много букв...... а может и нет....', 'статья, матья, первая', 6, '2019-11-25'),
(2, 2, 'Работа в MySQL с помощью PHP', 'Будьте внимательны при работе с базой MySQL. Старое расшерение MySQL больше не поддреживается PHP.', 'Расширение MySQL устарело с версии PHP 5.5.0, и удалено в версии 7.0.0. Вместо него используйте mysqli или PDO_MySQL. Ознакомьтесь также с обзором MySQL API для более детальной информации по выбору MySQL API.\r\n\r\nЭти функции позволяют вам работать с MySQL. За информацией о MySQL обращайтесь к » http://www.mysql.com/.\r\n\r\nДокументация MySQL находится по адресу » http://dev.mysql.com/doc/.', 'MySQL, PHP, ', 12, '2019-11-26'),
(3, 2, 'Студенты ВГУЭС - серебряные призеры III Национального межвузовского чемпионата «Молодые профессионалы»', 'В Москве подвели итоги и наградили победителей финальных соревнований по профессиональному мастерству в рамках III Национального межвузовского чемпионата «Молодые профессионалы» (Ворлдскиллс Россия). В финале МЕЖВУЗА 2019 принимали участие 500 конкурсантов из 73 вузов России, которые в течение двух дней состязались в профессиональном мастерстве по 52 компетенциям. Свыше 500 экспертов оценивали их работу.', 'В Москве подвели итоги и наградили победителей финальных соревнований по профессиональному мастерству в рамках III Национального межвузовского чемпионата «Молодые профессионалы» (Ворлдскиллс Россия). В финале МЕЖВУЗА 2019 принимали участие 500 конкурсантов из 73 вузов России, которые в течение двух дней состязались в профессиональном мастерстве по 52 компетенциям. Свыше 500 экспертов оценивали их работу.\r\n\r\nВсего по итогам первенства разыграли 64 золотых, 47 серебряных, 39 бронзовых медалей. Из них по 11 наград разной величины получили участники WorldSkills Juniors от 14 до 16 лет.\r\n\r\nКоманду ВГУЭС в финале Чемпионата представляли семеро студентов и две учащиеся школы-интерната для одарённых детей им. Н. Дубинина. Ребята выступили в 7 компетенциях и завоевали 6 серебряных медалей.\r\n\r\nСтуденты кафедры экономики и управления Фёдор Валл и Изабелла Мальцева стали вторыми в компетенции «Предпринимательство», а Антонина Богданова - в компетенции «Рекрутер».  Студентка Академического колледжа ВГУЭС Нозима Аслидинова – на пьедестале в компетенции «Промышленный дизайн». Ученицы 8 «Б» класса ШИОД Елизавета Бастина и Дарья Муковнина взяли «серебро» в компетенции «Предпринимательство» в линейке юниоров.\r\n\r\nАлександра Тузкова (кафедра информационных технологий и систем) по количеству набранных баллов показала второй результат в компетенции «3D моделирование компьютерных игр», Екатерина Щербаева (кафедра дизайна и технологий) заняла 5 место в стране в компетенции «Технология моды», Алексей Шкурик (кафедра туризма и экологии) - 4 место в «Организации экскурсионных услуг».', 'WS', 16, '2019-11-29'),
(4, 1, 'Реформирование института кураторства и награды за долголетний труд: второе заседание Ученого совета ВГУЭС', 'Второе в этом учебном году заседание Ученого совета ВГУЭС традиционно началось с вручения наград. Ректор ВГУЭС Татьяна Терентьева и президент ВГУЭС Геннадий Лазарев с гордостью поздравили с юбилейным, 40-м годом работы в стенах университета директора Академического колледжа ВГУЭС Людмилу Смагину.', 'Второе в этом учебном году заседание Ученого совета ВГУЭС традиционно началось с вручения наград. Ректор ВГУЭС Татьяна Терентьева и президент ВГУЭС Геннадий Лазарев с гордостью поздравили с юбилейным, 40-м годом работы в стенах университета директора Академического колледжа ВГУЭС Людмилу Смагину.\r\n\r\n— Таким почетным рабочим стажем и измеряется лояльность вузу, — подчеркнула ректор Татьяна Терентьева.\r\n\r\n— Спасибо руководству университета за то, что всегда ставит интересные задачи и мотивирует на развитие, а также за то, что ценит полученный результат, — отметила Людмила Смагина.\r\n\r\nЗаведующая кафедрой информационных технологий и систем ВГУЭС, кандидат экономических наук, Елена Кийкова проработала в университете 30 лет — ректор и президент ВГУЭС отметили эту дату также вручением почетной грамоты и букета цветов.\r\n\r\nДиректор студенческого городка Марина Иванкевич празднует в этом году 25-летие работы в вузе.\r\n\r\n— Благодаря работе Марины Александровны, общежития нашего университета комфортны для проживания студентов и становятся для них вторым домом, — отметил президент ВГУЭС Геннадий Лазарев.\r\n\r\nМладшего научного сотрудника центра научных исследований, проектов и программ ВГУЭС Евгению Абросимову поздравили с присвоением ученого звания кандидата социологических наук, а директора Международного института туризма и гостеприимства, кандидата экономических наук, Галину Гомилевскую — с благодарностью от департамента внутренней политики Администрации Приморского края за значимый вклад в социокультурную реабилитацию приморцев с ограниченными возможностями здоровья, формирование инклюзивного общества в Приморском крае, активное участие студентов Международного института туризма и гостеприимства ВГУЭС в качестве волонтеров в организации и проведении краевой акции  «Прививка от равнодушия».', 'ВГУЭС', 3, '2019-12-01'),
(5, 2, 'Газета vs Интернет: открытая лекция о противостоянии коммуникационных феноменов во ВГУЭС', 'Открытая лекция о противостоянии газеты и Интернета профессора Высшей школы телевидения ВГУЭС, доктора филологических наук, Павла Ушанова состоялась по инициативе студентов первого курса Высшей школы телевидения ВГУЭС.', 'Открытая лекция о противостоянии газеты и Интернета профессора Высшей школы телевидения ВГУЭС, доктора филологических наук, Павла Ушанова состоялась по инициативе студентов первого курса Высшей школы телевидения ВГУЭС. Как объяснила студентка Татьяна Чуйко:\r\n\r\n— Мы организовали цикл лекций, чтобы привлечь внимание потенциальных абитуриентов к университету и конкретно Высшей школе телевидения.\r\n\r\nОткрывая лекцию, профессор Павел Ушанов отметил, что идея противопоставить Интернет и газету принадлежит студентам:\r\n\r\n— Формулировка темы предполагает некий конфликт, определенную дискуссионность, об этом много говорили, особенно десять лет назад, разделяя аудиторию по способу получения информации. Однако объект для сравнения выбран не очень корректно: как мы прекрасно знаем, Интернет давно поглотил газету и газета прекрасно существует в рамках его пространства. Но, когда я начал глубже погружаться в предложенную тему, понял, что здесь есть над чем подумать и что обсудить.\r\n\r\nВ лекции профессор Ушанов напомнил основные этапы развития Интернет: от первых попыток объединить компьютеры, которые предпринимались в научно-исследовательских центрах СССР и США, до появления универсального протокола кодирования передачи данных, и последующем технологическом прорыве, когда за четыре года: с 1989-го до 1993-го количество пользователей увеличилось до 2 млн. Появление в 1993-м году первого интернет-браузера обеспечило простоту выхода в Интернет, и на всемирную паутину наконец обратили внимание СМИ.\r\n\r\nПарадигматический сдвиг случился в 2005 году с введением методики «Web 2.0», при которой пользователи контента стали одновременно и его создателями. В 2009 году только в России насчитывалось 6,5 млн блогеров, каждый из которых пытался претендовать на отдельное СМИ.', 'газета', 12, '2019-12-02'),
(6, 2, 'ВГУЭС готовит потенциальных ректоров в Сколково', 'Команда руководителей ВГУЭС начала обучение по образовательной программе «Школа ректоров» в Московской бизнес-школе управления СКОЛКОВО. В состав команды вошли специалисты кардинально разных сфер деятельности университета: международных коммуникаций, образовательной, финансовой, проектной, научной, информационно-технической.', 'Команда руководителей ВГУЭС начала обучение по образовательной программе «Школа ректоров» в Московской бизнес-школе управления СКОЛКОВО. В состав команды вошли специалисты кардинально разных сфер деятельности университета: международных коммуникаций, образовательной, финансовой, проектной, научной, информационно-технической.\r\n\r\nВосемнадцатая «Школа ректоров» посвящена управлению трансформацией университета.\r\n\r\nЦель программы - подготовить управленцев, ориентированных на реализацию масштабных проектов в сфере высшего образования. Цель ВГУЭС – создать новую достойную команду, которой в будущем можно будет передать управление университетом.\r\n\r\nПеред отъездом в Москву, с управленцами ВГУЭС встретились ректор университета Татьяна Терентьева и президент ВГУЭС Геннадий Лазарев. Руководители высказали свою политику развития университета и обозначили важность в этом процессе каждого из участников команды.\r\n\r\n- Помимо тех требований, которые установлены Сколково для претендентов на обучение, мы поставили дополнительные: члены команды должны быть молодыми и, следовательно, перспективными для университета, поскольку именно им через 5-7 лет нужно будет брать бразды правления в свои руки, - объясняет Татьяна Валерьевна. -  Главная задача – определить векторы развития университета, продумать стратегию, в которой они будут сопоставимы с векторами, определенными государством и новым цифровым миром. Проект команды должен представлять собой модель, которая будет соответствовать и современным реалиям, и завтрашнему дню. Для университета это обучение – инвестиция в команду топ-менеджеров завтрашнего дня.\r\n\r\nГеннадий Лазарев заострил внимание на важности развития стратегического мышления, умении мыслить масштабно и ставить достижимые и актуальные в перспективе цели.\r\n\r\nВпереди участников бизнес-школы ждут 6 образовательных модулей. В течение полугода они будут учиться у лучших экспертов-практиков в сфере образования и бизнеса, разбирать реальные кейсы, оттачивать навыки по разработке стратегических проектов в системе высшего образования, пройдут психофизиологическую подготовку управленцев и тренинги личного развития.', 'Сколково', 5, '2019-12-02'),
(7, 1, 'Студенты ВГУЭС блестяще завершили региональный чемпионат «Молодые профессионалы»', 'Во Владивостоке завершился V Открытый  региональный чемпионат «Молодые профессионалы».', 'Честь ВГУЭС в компетенциях чемпионата отстаивали студенты, обучающиеся по программам среднего профессионального образования в Колледже индустрии моды и красоты, Колледжа сервиса и дизайна, Академическом колледже и ученики Школы-интерната для одаренных детей им. Н.Н. Дубинина. Команда ВГУЭС, которая состояла из 31 человека, выступила в 12 компетенциях и завоевала 8 золотых, 10 серебряных и 6 бронзовых медалей.\r\n\r\nПобедителями Регионального чемпионата стали:\r\n\r\nКомпетенция «Физическая культура, спорт и фитнес» - Лайма Ермоленко (Колледж сервиса и дизайна ВГУЭС);\r\nКомпетенция «Промышленный дизайн» - Полина Вайтушко (Академический колледж ВГУЭС);\r\nКомпетенция «Поварское дело» - Ангелина Мартынова (Колледж сервиса и дизайна ВГУЭС);\r\nКомпетенция «3D Моделирование для компьютерных игр» - Ольга Федотенкова (Академический колледж ВГУЭС);\r\nКомпетенция «Фотография» - Екатерина Верченко (Колледж индустрии моды и красоты ВГУЭС);\r\nКомпетенция « Туризм» - Светлана Руденко и Полина Редько (Академический колледж ВГУЭС);\r\nКомпетенция «Организация экскурсионных услуг» - Валерия Баева (Академический колледж ВГУЭС);', 'WS', 19, '2019-11-24'),
(8, 2, 'Хочу больше знать о России: во ВГУЭС отмечают «Неделю толерантности»', 'Всю неделю во ВГУЭС проходили события, посвящённые Международному дню толерантности, который во всём мире отмечают 16 ноября.', 'Всю неделю во ВГУЭС проходили события, посвящённые Международному дню толерантности, который во всём мире отмечают 16 ноября.\r\n\r\n«Неделя толерантности» во ВГУЭС проводится каждый год и помогает иностранным студентам в адаптации к новому культурному окружению. Организатором такого праздника является Управление молодежной политики и Институт иностранных языков.\r\n\r\n– Каждый год мы делаем этот праздник, потому что хотим показать иностранцам, что ВГУЭС – это дом, в котором любят и уважают каждого, независимо от национальности, – комментирует Галина Касьяненко, специалист по работе с иностранными студентами.\r\n\r\nВ течение «Недели толерантности» иностранные студенты приняли участие в интеллектуальном турнире «Хочу больше знать о России». В Турнире приняли участие 12 команд. Три дня шли интеллектуальные бои. Ребята показали свои знания истории России, её символов, музыки и музыкальных инструментов, известных актеров и певцов. В итоге победителем турнира стала группа первокурсников БЛГ-19.\r\n\r\n– Я была обескуражена, когда узнала, что мне предстоит быть ведущей на турнире, участники которого иностранные студенты.  Я не знала, как я буду объяснять и, вообще, вести разговор с иностранными ребятами, как мы будем понимать друг друга. Но когда мы познакомились поближе, все опасения и волнения ушли. Они внимательно слушали и отвечали на русском языке. Конечно, иногда мы улыбались из-за их не совсем правильного произношения. Но, это мило. Я видела, как у них горят глаза, как они азартны, для них это было своего рода мини-испытанием на пути к победе. Я искренне болела за каждого из них и рада, что мне довелось пообщаться с ними и познакомить с русской культурой, – поделилась Екатерина Власенко, ведущая турнира, студентка 1 курса Высшей школы телевидения. \r\n\r\nТакже в течение недели гостями нескольких студенческих групп были иностранные студенты, которые ярко рассказали, что значит для них учеба в России, и как они живут удивительной и наполненной событиями студенческой жизнью. Повезло и иностранным студентам, которые провели уроки русского языка с изучением скороговорок, которые были подготовлены русскими студентами.', 'толерантность', 2, '2019-11-16');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `login` varchar(32) NOT NULL,
  `password` varchar(64) NOT NULL,
  `art_in_page` int(10) UNSIGNED NOT NULL DEFAULT '5'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `art_in_page`) VALUES
(1, 'admin', 'admin', 5),
(2, 'max', 'max', 3);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `articles`
--
ALTER TABLE `articles`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `login` (`login`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `articles`
--
ALTER TABLE `articles`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
